import { IonPage, IonHeader, IonContent } from "@ionic/react";
import Navbar from "../Navbar";

const ContentsOfContracts = () => {
  return (
    <IonPage>
      <IonHeader>
        <Navbar title="合同内容" />
      </IonHeader>
      <IonContent className="bg-white">
        <div className="px-2 scroll-auto">
          <div className="flex flex-col justify-center px-2 my-2 rounded-lg shadow-lg items-left">
            <div className="text-left">GF-2022-2604</div>
            <div className="mt-6 text-center">中小学生校外培训服务合同</div>
            <div className="mt-2 text-center">(2022年修订版)</div>
            <div className="mt-20 text-center">
              制定部门：[教育部市场监管总局]
            </div>
            <div className="mt-2 text-center">2022版</div>
            <div className="mt-6 font-bold text-center">使用说明</div>
            <div className="mt-2 indent-8">
              一、本合同文本为示范文本，供受培训者（学员）监护人与校外培训机构之间签订培训合同时参照使用，双方当事人也可使用本合同电子版在电子商务平台上签约。
            </div>
            <div className="indent-8">
              二、合同双方当事人在签约之前应当仔细阅读本合同内容，特别是具有选择性、补充性、填充性、修改性的内容。
            </div>
            <div className="indent-8">
              三、双方当事人应结合具体情况选定本合同文本的选择性条款（在方框内打“√”，以示双方确认），空白行供双方当事人自行约定或者补充约定。双方当事人可以对文本条款的内容进行修改、增补或删除，但不得随意减轻或者免除依法应当由校外培训机构承担的责任。合同签订生效后，未被修改的文本印刷文字视为双方同意内容。
            </div>
            <div className="indent-8">
              四、本合同文本中涉及到的选择、填写内容以手写项为优先。
            </div>
            <div className="indent-8">
              五、学前教育阶段培训机构可参考本示范文本制定符合自身特点的合同文本。
            </div>
            <div className="indent-8">
              六、本合同文本所称校外培训机构是指，面向中小学生开展非学历其他文化教育培训的培训机构。合同签订前，培训机构应当出示办学许可证，营业执照（或事业单位法人证书、民办非企业单位登记证书）等证明文件。
            </div>
            <div className="indent-8">
              七、本合同示范文本由教育部和市场监管总局联合制定。
            </div>
            <div className="mt-4 font-bold text-right">
              合同编号：1243214314321
            </div>
            <div className="my-4 text-2xl text-center">
              中小学生校外培训服务合同
            </div>
            <div>甲方（提供培训方）：<span className="font-semibold">北京亚大教育机构</span></div>
            <div>机构名称（与营业执照或办学许可证一致）：<span className="font-semibold">北京亚大教育机构</span> </div>
            <div>办学地址（与营业执照或办学许可证一致）：<span className="font-semibold">北京市海淀区大钟寺东路</span> </div>
            <div>审批机关：<span className="font-semibold">北京市教育局</span> </div>
            <div>登记注册机关：<span className="font-semibold">北京市教育局</span></div>
            <div>线上机构ICP备案号：EDU0987683909 </div>
            <div>统一社会信用代码：87790987655789 </div>
            <div>民非登记证/营业执照有效期：<span className="font-semibold">2030-10-01</span> </div>
            <div>联系人：杨晓佳 联系电话：010-83333333 </div>
            <div>乙方（接受培训方监护人）：孔莉</div>
            <div>学员姓名：张小白 性别：女 出生日期：20130309 </div>
            <div>身份证件类型：身份证 </div>
            <div>身份证号码：090987201303091778</div>
            <div>就读学校：北京市海淀幼儿园 就读年级：4年纪 </div>
            <div>联系电话：18909987789 </div>
            <div>监护人姓名：孔莉 与学员关系：母女 </div>
            <div>联系电话：18909987789 联系地址：北京市海淀区太阳园小区2栋309 </div>
            <div>身份证件类型：身份证 </div>
            <div>身份证号码：090987198009091778</div>
            <div>
              根据《中华人民共和国教育法》《中华人民共和国民办教育促进法》等有关法律、法规的规定，甲乙双方遵循平等、自愿、公平、诚实、守信的原则，遵循教育规律和青少年健康成长规律，经协商一致，签订本合同。
            </div>
            <div>第一条 培训服务</div>
            <div>本培训项目属于（单选）☐线下学科类培训 ☐线上学科类培训 ☐线下非学科类培训 ☐线上非学科类培训</div>
            <div>（一）培训项目</div>
            <div>课程名称：<span>机器人编程</span></div>
            <div>班级编号：<span>0909</span></div>
            <div>课程顾问（经办人）：<span>赵冉冉</span></div>
            <div>总课时数：<span>60</span></div>
            <div>每次培训课时（节）<span>周六上午10:00</span></div>
            <div>开课日期<span>2022.09.01</span></div>
            <div>预计结课日期<span>2023.09.01</span></div>
            <div>（二）培训要求</div>
            <div>1、培训方式：</div>
            <div>☐一对一（或一对   ）面授</div>
            <div>☐大班额面授课（标准：  人--  人）</div>
            <div>小班额面授课（班级限额≤   人）☐其他方式：    </div>
            <div>☐最低开班人数   ，低于此人数可不开班；</div>
            <div>☐本班开班不受最低人数限制</div>
            <div>2.是否指定授课教学人员：☐否  ☐是（指定教学人员姓名:张小白，指定教学人员未经乙方书面同意不得更换）；是否具备相应的教师资格或资质  ☐有  ☐没有</div>
            <div>3.实际授课地点（线上培训机构无需填写）： 北京市海淀区大钟寺东路中中大厦4-809</div>
            <div>4.学员接送方式（线上培训机构无需填写）： 家长接送          </div>
            <div>第二条  培训收费</div>
            <div>（一）收费标准（人民币）</div>
            <div>培训费用合计：          （大写）      （小写）元，其中：</div>
            <div>☐课时费：共计          元（          元/节）</div>
            <div>☐培训资料费：          元</div>
            <div>培训资料包括：                                 </div>
            <div>☐其他费用：</div>
            <div>名称：         金额：     元，收费依据：         </div>
            <div>名称：         金额：     元，收费依据：         </div>
            <div>名称：         金额：     元，收费依据：         </div>
            <div>（二）付费方式（人民币）</div>
            <div>经甲乙双方协商，乙方采取以下方式付款（单选）：</div>
            <div>☐     年     月    日之前一次性付清培训费用</div>
            <div>☐培训周期超过     个☐月/☐课时的，☐培训费用金额超过         元的：</div>
            <div>    年   月   日之前支付培训费用的    %，计     元</div>
            <div>    年   月   日之前支付培训费用的    %，计     元</div>
            <div>    年   月   日之前支付剩余     %，计      元</div>
            <div>☐其他                              （说明）</div>
            <div>（三）付费渠道</div>
            <div>乙方采取  ☐银行卡    ☐其他            方式支付培训费用。甲方的培训费用收款专用账户信息如下：</div>
            <div>开户银行：             </div>
            <div>银行账号：             </div>
            <div>（四）预收费监管方式</div>
            <div>☐银行托管</div>
            <div>☐风险保证金</div>
            <div>第三条 甲方的权利和义务</div>
            <div>
              （一）甲方有权按照国家有关政策规定和合同约定收取培训费用。甲方收取培训费用后应当及时向乙方开具正规发票。（按照国家有关政策要求，培训机构不得一次性向乙方收取或变相收取时间跨度超过3个月的费用；线上培训机构按课时收费的，每科不得一次性收取超过60课时的费用。）
            </div>
            <div>
              （二）甲方应当向乙方明示办学许可证、营业执照（或事业单位法人证书、民办非企业单位登记证书）、收费项目、收费标准、办学事项、退费办法、上课时间和服务承诺等内容，公开透明培训，接受社会监督，甲方不得在公示的项目和标准外向乙方收取其他费用。
            </div>
            <div>
              （三）甲方可以依照相关法律法规制定适合其机构自身的培训管理制度并在甲方培训场所醒目位置进行公示，甲方有权要求乙方遵照执行，以确保培训活动顺利进行。
            </div>
            <div>
              （四）甲方开设培训项目符合国家及培训场所所在地有关规定，遵循教育规律和学生身心发展规律，甲方及甲方的教职员工不得以任何方式向学员传播、讲授违反相关法律法规的培训内容。
            </div>
            <div>
              （五）甲方保证，按照国家有关政策要求配备与培训项目及培训规模相适应的教学及实训设施设备，配备与培训类别、层次及规模相适应的专兼职培训队伍，从事中小学学科知识培训的人员具有相应的教师资格，聘用的外籍从业人员符合国家有关规定。甲方应加强对所聘用人员的管理，确保不出现打骂、猥亵、虐待等损害学员身心健康或合法权益的行为。
            </div>
            <div>
              （六）甲方应确保提供给学员的培训班次与学员所处年级相匹配，提供的培训安排与乙方当地教育行政部门规定的教学时间不存在冲突。
            </div>
            <div>
              （七）甲方应做好消防、食品、公共卫生等安全管理，落实安全防范措施，建立健全安全管理制度和应急预警处理机制，防范各类安全责任事故发生。每次培训课程结束后，甲方应确保学员被乙方安全接走，双方另有约定的除外。
            </div>
            <div>（八）甲方若改变培训方式，需双方协商一致。</div>
            <div>
              （九）甲方应当依法保护在签订和履行合同过程中获悉的乙方及学员个人信息，不得泄露或者以其它不正当的方式使用乙方及学员个人隐私信息。未经乙方书面同意，甲方不得擅自使用乙方及学员的姓名、肖像、影像用于商业用途。
            </div>
            <div>
              （十）未经乙方书面同意，甲方不得将本合同约定的培训服务转让给第三方，不得擅自将学员转交给第三方机构进行培训。
            </div>
            <div>
              （十一）甲方应当设置处理合同和服务争议的内设部门或者专员，甲方的客服电话为：
              。
            </div>
            <div>第四条 乙方的权利和义务</div>
            <div>（一）乙方有按照本合同的约定接受甲方培训服务的权利。</div>
            <div>
              （二）乙方对培训过程以及培训人员的从业背景和执教信息享有知情权。乙方可以通过公开课、学习报告等适当方式了解学员的学习状况，甲方应当为乙方提供方便，接受乙方监督。
            </div>
            <div>（三）乙方应当按时足额向甲方缴纳培训费用。</div>
            <div>
              （四）乙方及学员应当自觉遵守甲方的各项培训管理制度和课堂纪律，不得妨碍其他学员的正常学习活动。乙方应当自觉遵守培训场所的各种安全规定，不从事危害自身或者他人人身、财产安全的不当行为。培训期间如因乙方或学员的原因造成甲方或他人人身、财产损害的，乙方应承担损害赔偿责任。
            </div>
            <div>
              （五）乙方及学员应当尊重甲方的知识产权，不得擅自对培训过程进行录音、录像。对于甲方拥有知识产权的培训材料或者课件，乙方及学员除在正常学习过程中合理使用外，不得私自复制、散发、销售，不得通过互联网进行分享、扩散和传播。
            </div>
            <div>
              （六）未经甲方同意，乙方不得擅自将本合同课程转让给第三方，或者将听课凭证转让、出借给他人使用。
            </div>
            <div>
              （七）如学员身体健康状况有特殊情形不再适合参与培训的，乙方应及时告知甲方，甲方可按照相关培训管理制度处理。
            </div>
            <div>第五条 培训退费</div>
            <div>（一）乙方在培训班正式开班前[ 10  ]天或开班后[  10 ]☐天 ☐课时前提出退学的，有权要求全额退费。</div>
            <div>（二）由于乙方的原因申请提前退学的，双方一致同意按如下方式办理退费（单选）： </div>
            <div>☐退还乙方未消耗课时所对应的培训费余额。 </div>
            <div>☐参加课程培训未达[   ]%者，退还乙方未消耗课时所对应的培训费余额；参加课程培训超过[   ]%者，退还乙方未消耗课时所对应培训费余额的[   ]%。</div>
            <div>☐其他                            </div>
            <div>（三）在办理退费时，对于已发放给乙方的培训资料的费用、已转付给第三方并无法索回的代收代支费用以及已向银行（第三方）支付的合理手续费用等，由甲方出示相关证明材料后，经协商，由乙方承担。</div>
            <div>（四）乙方所报班次低于最低开班人数不能开班的，甲方应退还乙方已缴付的全部费用。</div>
            <div>（五）甲方应在收到乙方书面退费申请后    （≤20）个工作日内，将相应退费款项支付给乙方。</div>
            <div>（六）退费方式：按乙方缴费原路径或双方协商一致路径退回。</div>
            <div>第六条  违约责任</div>
            <div>（一）甲方未达到合同约定的场所、教师等培训条件的，或甲方未经乙方书面同意，擅自变更培训方式或培训教师的，乙方有权要求解除合同，要求甲方退还剩余培训费并支付剩余培训费[   ]%金额的违约金。</div>
            <div>（二）由于甲方的原因，包括但不限于甲方办学许可证过期，被吊销办学许可证、营业执照（或事业单位法人证书、民办非企业单位登记证书），被责令停业整顿、撤销登记等原因，无法继续向乙方提供培训服务的，乙方有权要求解除合同，要求甲方退还剩余培训费并支付剩余培训费[   ]%金额的违约金。</div>
            <div>（三）甲方招生简章或者宣传材料中对培训师资和效果等所作的说明和允诺具体确定，并对培训合同的订立以及课程价格的确定有重大影响的，应当视为要约。相关说明和允诺即使未载入本合同，亦应当视为合同内容，甲方所提供服务与上述相关说明和允诺不相符的，乙方有权要求解除合同，要求甲方退还剩余培训费并支付剩余培训费[   ]%金额的违约金。</div>
            <div>（四）未经乙方书面同意，甲方擅自将本合同约定的服务转给第三方或将学员转交给第三方机构进行培训的，乙方有权要求解除合同，要求甲方退还剩余培训费并支付剩余培训费[   ]%金额的违约金。</div>
            <div>（五）因甲方违约，双方就退费事宜书面达成一致后，甲方应于    （≤20）个工作日内将各项相关费用支付给乙方，每逾期一日应按逾期金额[   ]%的标准（不超过万分之六点五）向乙方支付违约金。</div>
            <div>（六）乙方逾期未支付培训费用的，甲方有权中止培训服务，经书面催告后仍不支付的，甲方有权终止培训服务，乙方须支付实际已培训天数的课时费，每逾期一日应按逾期金额[   ]%的标准（不超过万分之六点五）向甲方支付违约金。</div>
            <div>（七）由于乙方的原因，无法继续接受培训服务的，甲方不承担违约责任。</div>
            <div>（八）因战争、自然灾害、传染性疾病等不可抗力致使本合同无法继续履行的，双方互不承担违约责任，受不可抗力影响的一方应及时书面通知对方，双方一致同意按如下方式处理（单选）：</div>
            <div>☐按照实际消耗课时结算培训费用</div>
            <div>☐调整培训时间或内容</div>
            <div>☐其他______________________</div>
            <div>第七条  争议处理</div>
            <div>本合同在履行过程中发生争议，双方可协商解决，协商不成的，一方可以向行业协会申请调解，仍无法解决的，双方一致同意按如下方式处理（单选）：</div>
            <div>☐依法向                 仲裁委员会申请仲裁</div>
            <div>☐依法向                 人民法院提起诉讼</div>
            <div>第八条  其他约定</div>
            <div>本合同未尽事宜，由下列条款进行约定。</div>
            <div>1. </div>
            <div>2. </div>
            <div>3. </div>
            <div>第九条  生效方式</div>
            <div>本合同自甲方盖章乙方签字或双方采用合法有效的电子签名方式签署之日起生效。</div>
            <div>合同正本连同补充条款共  页，一式  份，甲乙双方各执  份，各份具有同等法律效力。</div>
            <div></div>
            <div></div>
            <div></div>
            <div></div>

            
            
            <div>甲方（盖章）： 乙方（接受培训方监护人签字）： </div>
            <div>甲方代表（经办人签字）： </div>
            <div> 年 月 日 年 月 日</div>
          </div>
        </div>
      </IonContent>
    </IonPage>
  );
};

export default ContentsOfContracts;
