import { IonPage, IonHeader, IonContent } from "@ionic/react";
import Navbar from "../Navbar";

const ContentsOfContracts=()=>{
  return (
    <IonPage>
      <IonHeader>
        <Navbar title="合同内容" />
      </IonHeader>
      <IonContent>
        <div className="bg-white scroll-auto">
          <div className="flex flex-col justify-center mx-2 my-2 rounded-lg shadow-lg items-left">
          <div className="text-left">GF-2022-2604</div>
          <div className="mt-6 text-center">中小学生校外培训服务合同</div>
          <div className="mt-2 text-center">(2022年修订版)</div>
          <div className="mt-20 text-center">制定部门：[教育部市场监管总局]</div>
          <div className="mt-2 text-center">2022版</div>
          <div className="mt-6 font-bold text-center">使用说明</div>
          <div className="mt-2 indent-8">一、本合同文本为示范文本，供受培训者（学员）监护人与校外培训机构之间签订培训合同时参照使用，双方当事人也可使用本合同电子版在电子商务平台上签约。</div>
          <div className="indent-8">二、合同双方当事人在签约之前应当仔细阅读本合同内容，特别是具有选择性、补充性、填充性、修改性的内容。</div>
          <div className="indent-8">三、双方当事人应结合具体情况选定本合同文本的选择性条款（在方框内打“√”，以示双方确认），空白行供双方当事人自行约定或者补充约定。双方当事人可以对文本条款的内容进行修改、增补或删除，但不得随意减轻或者免除依法应当由校外培训机构承担的责任。合同签订生效后，未被修改的文本印刷文字视为双方同意内容。</div>
          <div className="indent-8">四、本合同文本中涉及到的选择、填写内容以手写项为优先。</div>
          <div className="indent-8">五、学前教育阶段培训机构可参考本示范文本制定符合自身特点的合同文本。</div>
          <div className="indent-8">六、本合同文本所称校外培训机构是指，面向中小学生开展非学历其他文化教育培训的培训机构。合同签订前，培训机构应当出示办学许可证，营业执照（或事业单位法人证书、民办非企业单位登记证书）等证明文件。</div>
          <div className="indent-8">七、本合同示范文本由教育部和市场监管总局联合制定。</div>
          <div className="mt-4 font-bold text-right">合同编号：1243214314321</div>
          <div className="my-4 text-2xl text-center">中小学生校外培训服务合同</div>
          <div>甲方（提供培训方）：</div>
          <div>机构名称（与营业执照或办学许可证一致）：          </div>
          <div>办学地址（与营业执照或办学许可证一致）：         </div>
          <div>审批机关：              登记注册机关：           </div>
          <div>审批机关：              登记注册机关：           </div>
          <div>线上机构ICP备案号：                             </div>
          <div>统一社会信用代码：                                </div>
          <div>民非登记证/营业执照有效期：                        </div>
          <div>联系人：                   联系电话：             </div>
          <div>乙方（接受培训方监护人）：</div>
          <div>学员姓名：          性别：     出生日期：         </div>
          <div>身份证件类型及号码：                             </div>
          <div>就读学校：                 就读年级：            </div>
          <div>联系电话：              </div>
          <div>监护人姓名：               与学员关系：           </div>
          <div>联系电话：                 联系地址：            </div>
          <div>身份证件类型及号码：                             </div>
          <div>根据《中华人民共和国教育法》《中华人民共和国民办教育促进法》等有关法律、法规的规定，甲乙双方遵循平等、自愿、公平、诚实、守信的原则，遵循教育规律和青少年健康成长规律，经协商一致，签订本合同。</div>
          <div>第一条  适用对象</div>
          <div>本合同适用受培训者（学员）一般为在校的中小学生。</div>
          <div>第二条  甲方的权利和义务</div>
          <div>（一）甲方有权按照国家有关政策规定和合同约定收取培训费用。甲方收取培训费用后应当及时向乙方开具正规发票。（按照国家有关政策要求，培训机构不得一次性向乙方收取或变相收取时间跨度超过3个月的费用；线上培训机构按课时收费的，每科不得一次性收取超过60课时的费用。）</div>
          <div>（二）甲方应当向乙方明示办学许可证、营业执照（或事业单位法人证书、民办非企业单位登记证书）、收费项目、收费标准、办学事项、退费办法、上课时间和服务承诺等内容，公开透明培训，接受社会监督，甲方不得在公示的项目和标准外向乙方收取其他费用。</div>
          <div>（三）甲方可以依照相关法律法规制定适合其机构自身的培训管理制度并在甲方培训场所醒目位置进行公示，甲方有权要求乙方遵照执行，以确保培训活动顺利进行。</div>
          <div>（四）甲方开设培训项目符合国家及培训场所所在地有关规定，遵循教育规律和学生身心发展规律，甲方及甲方的教职员工不得以任何方式向学员传播、讲授违反相关法律法规的培训内容。</div>
          <div>（五）甲方保证，按照国家有关政策要求配备与培训项目及培训规模相适应的教学及实训设施设备，配备与培训类别、层次及规模相适应的专兼职培训队伍，从事中小学学科知识培训的人员具有相应的教师资格，聘用的外籍从业人员符合国家有关规定。甲方应加强对所聘用人员的管理，确保不出现打骂、猥亵、虐待等损害学员身心健康或合法权益的行为。</div>
          <div>（六）甲方应确保提供给学员的培训班次与学员所处年级相匹配，提供的培训安排与乙方当地教育行政部门规定的教学时间不存在冲突。</div>
          <div>（七）甲方应做好消防、食品、公共卫生等安全管理，落实安全防范措施，建立健全安全管理制度和应急预警处理机制，防范各类安全责任事故发生。每次培训课程结束后，甲方应确保学员被乙方安全接走，双方另有约定的除外。</div>
          <div>（八）甲方若改变培训方式，需双方协商一致。</div>
          <div>（九）甲方应当依法保护在签订和履行合同过程中获悉的乙方及学员个人信息，不得泄露或者以其它不正当的方式使用乙方及学员个人隐私信息。未经乙方书面同意，甲方不得擅自使用乙方及学员的姓名、肖像、影像用于商业用途。</div>
          <div>（十）未经乙方书面同意，甲方不得将本合同约定的培训服务转让给第三方，不得擅自将学员转交给第三方机构进行培训。</div>
          <div>（十一）甲方应当设置处理合同和服务争议的内设部门或者专员，甲方的客服电话为：                       。</div>
          <div>第三条  乙方的权利和义务</div>
          <div>（一）乙方有按照本合同的约定接受甲方培训服务的权利。</div>
          <div>（二）乙方对培训过程以及培训人员的从业背景和执教信息享有知情权。乙方可以通过公开课、学习报告等适当方式了解学员的学习状况，甲方应当为乙方提供方便，接受乙方监督。</div>
          <div>（三）乙方应当按时足额向甲方缴纳培训费用。</div>
          <div>（四）乙方及学员应当自觉遵守甲方的各项培训管理制度和课堂纪律，不得妨碍其他学员的正常学习活动。乙方应当自觉遵守培训场所的各种安全规定，不从事危害自身或者他人人身、财产安全的不当行为。培训期间如因乙方或学员的原因造成甲方或他人人身、财产损害的，乙方应承担损害赔偿责任。</div>
          <div>（五）乙方及学员应当尊重甲方的知识产权，不得擅自对培训过程进行录音、录像。对于甲方拥有知识产权的培训材料或者课件，乙方及学员除在正常学习过程中合理使用外，不得私自复制、散发、销售，不得通过互联网进行分享、扩散和传播。</div>
          <div>（六）未经甲方同意，乙方不得擅自将本合同课程转让给第三方，或者将听课凭证转让、出借给他人使用。</div>
          <div>（七）如学员身体健康状况有特殊情形不再适合参与培训的，乙方应及时告知甲方，甲方可按照相关培训管理制度处理。</div>
          <div>第四条  培训服务</div>
          <div>（一）培训项目</div>
          <div>课程名称：                 班级编号：            </div>
          <div>课程顾问（经办人）：       总课时数（节）：      </div>
          <div>每次培训课时（节）：       上课时间：            </div>
          <div>开课日期：                 预计结课日期：        </div>

          <div>甲方（盖章）：                  乙方（接受培训方监护人签字）：      </div>
          <div>甲方代表（经办人签字）：         </div>
          <div>     年   月   日                       年   月   日</div>
          </div>
        </div>
      </IonContent>
    </IonPage>
    
  )
}

export default ContentsOfContracts